resumos/introdução/resumo.tex
% Created 2020-11-24 ter 20:24
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Glauber Prado}
\date{24-11-2020}
\title{}
\hypersetup{
 pdfauthor={Glauber Prado},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.0.50 (Org mode 9.3.7)}, 
 pdflang={English}}
\begin{document}

\maketitle 
\section{Introdução}
\label{sec:orgb5fdc5d}
Todos sabemos programar e isso não é algo muito dificil, fazer um software
simples funcionar é algo que até uma criança é capaz. O problema é escalar
isso e conseguir uma arquitetura que permita aumentar esse código de forma que
não quebre todo o resto e você tenha que reescrever tudo que já foi feito.

O que vamos aprender nesta matéria é justamente isso, uma forma de codificar
utilizando um arquitetura limpa em que cada componente está no seu devido
lugar e que não interfere na inserção de novos componentes. Pra isso vamos
utilizar um design inspirado em Robert C. Martin em seu livro: "Clean
Architecture: A Craftsman’s Guide to Software Structure".
\end{document}
